zequinha-taveira/OpenFIDO/src/hal/nrf52/hal_ble_nrf52.c
/**
 * @file hal_ble_nrf52.c
 * @brief Nordic nRF52 BLE Hardware Abstraction Layer Implementation
 *
 * Implements BLE HAL using Nordic SoftDevice BLE stack (S132/S140).
 * Provides FIDO GATT service, advertising, pairing, and encryption.
 *
 * @copyright Copyright (c) 2025 OpenFIDO Contributors
 * @license MIT License
 */

#include "../../utils/logger.h"
#include "../hal_ble.h"

#ifdef NRF52

#include <string.h>

#include "ble.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_gap.h"
#include "ble_gatts.h"
#include "ble_hci.h"
#include "nrf_ble_gatt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"

/* BLE Configuration */
#define APP_BLE_CONN_CFG_TAG 1
#define APP_BLE_OBSERVER_PRIO 3
#define MIN_CONN_INTERVAL MSEC_TO_UNITS(100, UNIT_1_25_MS)
#define MAX_CONN_INTERVAL MSEC_TO_UNITS(200, UNIT_1_25_MS)
#define SLAVE_LATENCY 0
#define CONN_SUP_TIMEOUT MSEC_TO_UNITS(4000, UNIT_10_MS)

/* Advertising Configuration */
#define APP_ADV_INTERVAL 300
#define APP_ADV_DURATION 18000
#define DEVICE_NAME "OpenFIDO"

/* GATT Service Handles */
typedef struct {
    uint16_t service_handle;
    uint16_t char_handles[8];
    uint8_t char_count;
} gatt_service_t;

/* BLE State */
static struct {
    bool initialized;
    hal_ble_event_callback_t event_callback;
    uint16_t conn_handle;
    gatt_service_t services[4];
    uint8_t service_count;
    bool advertising;
    nrf_ble_gatt_t gatt_module;
    ble_advertising_t adv_module;
} ble_state = {.conn_handle = BLE_CONN_HANDLE_INVALID,
               .initialized = false,
               .advertising = false,
               .service_count = 0};

/* Forward declarations */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context);
static void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt);
static void advertising_evt_handler(ble_adv_evt_t ble_adv_evt);
static void conn_params_evt_handler(ble_conn_params_evt_t *p_evt);
static void pm_evt_handler(pm_evt_t const *p_evt);

/* ========== Helper Functions ========== */

static void send_event(hal_ble_event_type_t type)
{
    if (ble_state.event_callback) {
        hal_ble_event_t event = {.type = type,
                                 .conn_handle = ble_state.conn_handle,
                                 .char_handle = 0,
                                 .data = NULL,
                                 .data_len = 0,
                                 .mtu = 0,
                                 .encrypted = false,
                                 .error_code = 0};
        ble_state.event_callback(&event);
    }
}

/* ========== Initialization and Control ========== */

int hal_ble_init(hal_ble_event_callback_t callback)
{
    if (ble_state.initialized) {
        return HAL_BLE_OK;
    }

    if (callback == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    LOG_INFO("Initializing nRF52 BLE HAL");

    ble_state.event_callback = callback;

    /* Initialize SoftDevice */
    ret_code_t err_code = nrf_sdh_enable_request();
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("SoftDevice enable failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Configure BLE stack */
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("BLE config failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Enable BLE stack */
    err_code = nrf_sdh_ble_enable(&ram_start);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("BLE enable failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Register BLE event handler */
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    /* Initialize GATT module */
    err_code = nrf_ble_gatt_init(&ble_state.gatt_module, gatt_evt_handler);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("GATT init failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Initialize Peer Manager for pairing */
    err_code = pm_init();
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Peer Manager init failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Configure security */
    ble_gap_sec_params_t sec_params = {.bond = 1,
                                       .mitm = 1,
                                       .lesc = 1,
                                       .keypress = 0,
                                       .io_caps = BLE_GAP_IO_CAPS_DISPLAY_YESNO,
                                       .oob = 0,
                                       .min_key_size = 7,
                                       .max_key_size = 16,
                                       .kdist_own = {.enc = 1, .id = 1},
                                       .kdist_peer = {.enc = 1, .id = 1}};

    err_code = pm_sec_params_set(&sec_params);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Security params failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Register PM event handler */
    err_code = pm_register(pm_evt_handler);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("PM register failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Set device name */
    ble_gap_conn_sec_mode_t sec_mode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code =
        sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *) DEVICE_NAME, strlen(DEVICE_NAME));
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Device name set failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    ble_state.initialized = true;
    LOG_INFO("nRF52 BLE HAL initialized");

    return HAL_BLE_OK;
}

int hal_ble_deinit(void)
{
    if (!ble_state.initialized) {
        return HAL_BLE_OK;
    }

    hal_ble_stop_advertising();

    if (ble_state.conn_handle != BLE_CONN_HANDLE_INVALID) {
        sd_ble_gap_disconnect(ble_state.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }

