zequinha-taveira/OpenFIDO/src/hal/nrf52/hal_ble_nrf52.c
    nrf_sdh_disable_request();
    ble_state.initialized = false;

    return HAL_BLE_OK;
}

bool hal_ble_is_supported(void)
{
    return true;
}

/* ========== Advertising ========== */

int hal_ble_start_advertising(const hal_ble_adv_params_t *params)
{
    if (!ble_state.initialized) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    ret_code_t err_code;

    /* Set advertising data */
    ble_advdata_t advdata = {0};
    ble_advdata_t srdata = {0};

    advdata.name_type = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    /* Add FIDO service UUID to advertising data */
    ble_uuid_t adv_uuids[] = {{0xFFFD, BLE_UUID_TYPE_BLE}};
    srdata.uuids_complete.uuid_cnt = 1;
    srdata.uuids_complete.p_uuids = adv_uuids;

    /* Configure advertising parameters */
    ble_gap_adv_params_t adv_params = {0};
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr = NULL;
    adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
    adv_params.interval = (params && params->interval_min_ms)
                              ? MSEC_TO_UNITS(params->interval_min_ms, UNIT_0_625_MS)
                              : APP_ADV_INTERVAL;
    adv_params.duration =
        (params && params->timeout_s) ? params->timeout_s * 100 : APP_ADV_DURATION;
    adv_params.primary_phy = BLE_GAP_PHY_1MBPS;

    /* Encode advertising data */
    uint8_t adv_data_buf[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
    ble_gap_adv_data_t gap_adv_data = {
        .adv_data = {.p_data = adv_data_buf, .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX},
        .scan_rsp_data = {.p_data = NULL, .len = 0}};

    err_code =
        ble_advdata_encode(&advdata, gap_adv_data.adv_data.p_data, &gap_adv_data.adv_data.len);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Advertising data encode failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    /* Start advertising */
    uint8_t adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    err_code = sd_ble_gap_adv_set_configure(&adv_handle, &gap_adv_data, &adv_params);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Advertising configure failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    err_code = sd_ble_gap_adv_start(adv_handle, APP_BLE_CONN_CFG_TAG);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Advertising start failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    ble_state.advertising = true;
    LOG_INFO("BLE advertising started");

    return HAL_BLE_OK;
}

int hal_ble_stop_advertising(void)
{
    if (!ble_state.advertising) {
        return HAL_BLE_OK;
    }

    ret_code_t err_code = sd_ble_gap_adv_stop(BLE_GAP_ADV_SET_HANDLE_NOT_SET);
    if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE) {
        LOG_ERROR("Advertising stop failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    ble_state.advertising = false;
    LOG_INFO("BLE advertising stopped");

    return HAL_BLE_OK;
}

bool hal_ble_is_advertising(void)
{
    return ble_state.advertising;
}

/* ========== GATT Operations ========== */

int hal_ble_gatt_register_service(uint16_t service_uuid, uint16_t *service_handle)
{
    if (!ble_state.initialized || service_handle == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    if (ble_state.service_count >= 4) {
        return HAL_BLE_ERROR_NO_MEM;
    }

    ble_uuid_t ble_uuid = {.uuid = service_uuid, .type = BLE_UUID_TYPE_BLE};

    ret_code_t err_code =
        sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid,
                                 &ble_state.services[ble_state.service_count].service_handle);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Service add failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    *service_handle = ble_state.services[ble_state.service_count].service_handle;
    ble_state.services[ble_state.service_count].char_count = 0;
    ble_state.service_count++;

    LOG_INFO("GATT service registered: UUID=0x%04X, handle=%d", service_uuid, *service_handle);

    return HAL_BLE_OK;
}

int hal_ble_gatt_add_characteristic(uint16_t service_handle, uint32_t char_uuid, uint8_t properties,
                                    uint16_t max_len, uint16_t *char_handle)
{
    if (!ble_state.initialized || char_handle == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    /* Find service */
    gatt_service_t *service = NULL;
    for (uint8_t i = 0; i < ble_state.service_count; i++) {
        if (ble_state.services[i].service_handle == service_handle) {
            service = &ble_state.services[i];
            break;
        }
    }

    if (service == NULL || service->char_count >= 8) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    /* Configure characteristic */
    ble_gatts_char_md_t char_md = {0};
    ble_gatts_attr_md_t cccd_md = {0};
    ble_gatts_attr_t attr_char_value = {0};
    ble_uuid_t ble_uuid = {0};
    ble_gatts_attr_md_t attr_md = {0};

    /* Set characteristic properties */
    if (properties & HAL_BLE_GATT_PROP_READ) {
        char_md.char_props.read = 1;
    }
    if (properties & HAL_BLE_GATT_PROP_WRITE) {
        char_md.char_props.write = 1;
    }
    if (properties & HAL_BLE_GATT_PROP_WRITE_NO_RSP) {
        char_md.char_props.write_wo_resp = 1;
    }
    if (properties & HAL_BLE_GATT_PROP_NOTIFY) {
        char_md.char_props.notify = 1;
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
        cccd_md.vloc = BLE_GATTS_VLOC_STACK;
        char_md.p_cccd_md = &cccd_md;
    }

    /* Set UUID */
    ble_uuid.type = BLE_UUID_TYPE_VENDOR_BEGIN;
    ble_uuid.uuid = (uint16_t) (char_uuid & 0xFFFF);

    /* Add vendor-specific UUID if needed */
    ble_uuid128_t base_uuid = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x00,
                               0x80, 0x00, 0x00, 0x80, 0x5F, 0x9B, 0x34, 0xFB};
    memcpy(&base_uuid[12], &char_uuid, 4);
    sd_ble_uuid_vs_add(&base_uuid, &ble_uuid.type);

    /* Set attribute metadata */
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&attr_md.write_perm);
    attr_md.vloc = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen = 1;

