zequinha-taveira/OpenFIDO/src/hal/nrf52/hal_ble_nrf52.c
    /* Set attribute value */
    attr_char_value.p_uuid = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len = 0;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len = max_len;

    /* Add characteristic */
    ble_gatts_char_handles_t handles;
    ret_code_t err_code =
        sd_ble_gatts_characteristic_add(service_handle, &char_md, &attr_char_value, &handles);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Characteristic add failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    *char_handle = handles.value_handle;
    service->char_handles[service->char_count++] = handles.value_handle;

    LOG_INFO("GATT characteristic added: UUID=0x%08X, handle=%d", char_uuid, *char_handle);

    return HAL_BLE_OK;
}

int hal_ble_notify(hal_ble_conn_handle_t conn_handle, uint16_t char_handle, const uint8_t *data,
                   size_t len)
{
    if (!ble_state.initialized || data == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    if (conn_handle == HAL_BLE_CONN_HANDLE_INVALID) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    ble_gatts_hvx_params_t hvx_params = {0};
    uint16_t hvx_len = len;

    hvx_params.handle = char_handle;
    hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.offset = 0;
    hvx_params.p_len = &hvx_len;
    hvx_params.p_data = data;

    ret_code_t err_code = sd_ble_gatts_hvx(conn_handle, &hvx_params);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Notification send failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

int hal_ble_gatt_set_value(uint16_t char_handle, const uint8_t *data, size_t len)
{
    if (!ble_state.initialized || data == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    ble_gatts_value_t gatts_value = {0};
    gatts_value.len = len;
    gatts_value.offset = 0;
    gatts_value.p_value = (uint8_t *) data;

    ret_code_t err_code = sd_ble_gatts_value_set(ble_state.conn_handle, char_handle, &gatts_value);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("GATT value set failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

/* ========== Connection Management ========== */

int hal_ble_disconnect(hal_ble_conn_handle_t conn_handle)
{
    if (!ble_state.initialized) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    ret_code_t err_code =
        sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Disconnect failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

int hal_ble_get_mtu(hal_ble_conn_handle_t conn_handle, uint16_t *mtu)
{
    if (!ble_state.initialized || mtu == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    *mtu = nrf_ble_gatt_eff_mtu_get(&ble_state.gatt_module, conn_handle);
    return HAL_BLE_OK;
}

int hal_ble_is_encrypted(hal_ble_conn_handle_t conn_handle, bool *encrypted)
{
    if (!ble_state.initialized || encrypted == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    ble_gap_conn_sec_t conn_sec;
    ret_code_t err_code = sd_ble_gap_conn_sec_get(conn_handle, &conn_sec);
    if (err_code != NRF_SUCCESS) {
        return HAL_BLE_ERROR;
    }

    *encrypted = (conn_sec.sec_mode.sm > 0 && conn_sec.sec_mode.lv > 0);
    return HAL_BLE_OK;
}

int hal_ble_update_connection_params(hal_ble_conn_handle_t conn_handle, uint16_t interval_min_ms,
                                     uint16_t interval_max_ms, uint16_t latency,
                                     uint16_t timeout_ms)
{
    if (!ble_state.initialized) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    ble_gap_conn_params_t conn_params = {0};
    conn_params.min_conn_interval = MSEC_TO_UNITS(interval_min_ms, UNIT_1_25_MS);
    conn_params.max_conn_interval = MSEC_TO_UNITS(interval_max_ms, UNIT_1_25_MS);
    conn_params.slave_latency = latency;
    conn_params.conn_sup_timeout = MSEC_TO_UNITS(timeout_ms, UNIT_10_MS);

    ret_code_t err_code = sd_ble_gap_conn_param_update(conn_handle, &conn_params);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Connection param update failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

/* ========== Security Operations ========== */

int hal_ble_set_security_config(const hal_ble_security_config_t *config)
{
    if (!ble_state.initialized || config == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    /* Security configuration is set during initialization */
    /* This function could be extended to update security settings dynamically */

    return HAL_BLE_OK;
}

int hal_ble_start_pairing(hal_ble_conn_handle_t conn_handle)
{
    if (!ble_state.initialized) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    ret_code_t err_code = pm_conn_secure(conn_handle, false);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Pairing start failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

int hal_ble_pairing_confirm(hal_ble_conn_handle_t conn_handle, bool confirm)
{
    if (!ble_state.initialized) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    ret_code_t err_code = sd_ble_gap_auth_key_reply(
        conn_handle, confirm ? BLE_GAP_AUTH_KEY_TYPE_PASSKEY : BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Pairing confirm failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

int hal_ble_delete_bond(hal_ble_conn_handle_t conn_handle)
{
    if (!ble_state.initialized) {
        return HAL_BLE_ERROR_INVALID_STATE;
    }

    pm_peer_id_t peer_id;
    ret_code_t err_code = pm_peer_id_get(conn_handle, &peer_id);
    if (err_code != NRF_SUCCESS) {
        return HAL_BLE_ERROR;
    }

    err_code = pm_peer_delete(peer_id);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Bond delete failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

/* ========== Device Information ========== */

