zequinha-taveira/OpenFIDO/src/hal/nrf52/hal_ble_nrf52.c
int hal_ble_set_device_name(const char *name)
{
    if (!ble_state.initialized || name == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    ble_gap_conn_sec_mode_t sec_mode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    ret_code_t err_code =
        sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *) name, strlen(name));
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Device name set failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    return HAL_BLE_OK;
}

int hal_ble_get_address(uint8_t addr[6])
{
    if (!ble_state.initialized || addr == NULL) {
        return HAL_BLE_ERROR_INVALID_PARAM;
    }

    ble_gap_addr_t gap_addr;
    ret_code_t err_code = sd_ble_gap_addr_get(&gap_addr);
    if (err_code != NRF_SUCCESS) {
        LOG_ERROR("Address get failed: %d", err_code);
        return HAL_BLE_ERROR;
    }

    memcpy(addr, gap_addr.addr, 6);
    return HAL_BLE_OK;
}

/* ========== Event Handlers ========== */

static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED:
            LOG_INFO("BLE connected");
            ble_state.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            ble_state.advertising = false;
            send_event(HAL_BLE_EVENT_CONNECTED);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            LOG_INFO("BLE disconnected");
            ble_state.conn_handle = BLE_CONN_HANDLE_INVALID;
            send_event(HAL_BLE_EVENT_DISCONNECTED);
            /* Restart advertising */
            hal_ble_start_advertising(NULL);
            break;

        case BLE_GATTS_EVT_WRITE: {
            const ble_gatts_evt_write_t *p_write = &p_ble_evt->evt.gatts_evt.params.write;
            if (ble_state.event_callback) {
                hal_ble_event_t event = {.type = HAL_BLE_EVENT_WRITE,
                                         .conn_handle = p_ble_evt->evt.gatts_evt.conn_handle,
                                         .char_handle = p_write->handle,
                                         .data = p_write->data,
                                         .data_len = p_write->len,
                                         .mtu = 0,
                                         .encrypted = false,
                                         .error_code = 0};
                ble_state.event_callback(&event);
            }
            break;
        }

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
            send_event(HAL_BLE_EVENT_NOTIFY_COMPLETE);
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            /* Pairing request - handled by Peer Manager */
            err_code = pm_conn_secure(p_ble_evt->evt.gap_evt.conn_handle, false);
            if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_BUSY) {
                LOG_ERROR("Security request failed: %d", err_code);
            }
            break;

        case BLE_GAP_EVT_CONN_SEC_UPDATE: {
            const ble_gap_evt_conn_sec_update_t *p_sec =
                &p_ble_evt->evt.gap_evt.params.conn_sec_update;
            if (ble_state.event_callback) {
                hal_ble_event_t event = {.type = HAL_BLE_EVENT_ENCRYPTION_CHANGED,
                                         .conn_handle = p_ble_evt->evt.gap_evt.conn_handle,
                                         .char_handle = 0,
                                         .data = NULL,
                                         .data_len = 0,
                                         .mtu = 0,
                                         .encrypted = (p_sec->conn_sec.sec_mode.sm > 0 &&
                                                       p_sec->conn_sec.sec_mode.lv > 0),
                                         .error_code = 0};
                ble_state.event_callback(&event);
            }
            break;
        }

        default:
            break;
    }
}

static void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED) {
        LOG_INFO("MTU updated to %d", p_evt->params.att_mtu_effective);
        if (ble_state.event_callback) {
            hal_ble_event_t event = {.type = HAL_BLE_EVENT_MTU_CHANGED,
                                     .conn_handle = p_evt->conn_handle,
                                     .char_handle = 0,
                                     .data = NULL,
                                     .data_len = 0,
                                     .mtu = p_evt->params.att_mtu_effective,
                                     .encrypted = false,
                                     .error_code = 0};
            ble_state.event_callback(&event);
        }
    }
}

static void advertising_evt_handler(ble_adv_evt_t ble_adv_evt)
{
    switch (ble_adv_evt) {
        case BLE_ADV_EVT_FAST:
            LOG_INFO("Fast advertising started");
            break;

        case BLE_ADV_EVT_IDLE:
            LOG_INFO("Advertising idle");
            ble_state.advertising = false;
            break;

        default:
            break;
    }
}

static void conn_params_evt_handler(ble_conn_params_evt_t *p_evt)
{
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
        LOG_ERROR("Connection parameters negotiation failed");
    }
}

static void pm_evt_handler(pm_evt_t const *p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id) {
        case PM_EVT_BONDED_PEER_CONNECTED:
            LOG_INFO("Bonded peer connected");
            break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
            LOG_INFO("Pairing succeeded");
            send_event(HAL_BLE_EVENT_PAIRING_COMPLETE);
            break;

        case PM_EVT_CONN_SEC_FAILED:
            LOG_ERROR("Pairing failed");
            if (ble_state.event_callback) {
                hal_ble_event_t event = {.type = HAL_BLE_EVENT_PAIRING_FAILED,
                                         .conn_handle = p_evt->conn_handle,
                                         .char_handle = 0,
                                         .data = NULL,
                                         .data_len = 0,
                                         .mtu = 0,
                                         .encrypted = false,
                                         .error_code = p_evt->params.conn_sec_failed.error};
                ble_state.event_callback(&event);
            }
            break;

        default:
            break;
    }
}

#endif /* NRF52 */
